zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/include/cyabs_rtos.h
/** Checks if the thread is running
 *
 * This function is called to determine if a thread is actively running or not. For information on
 * the thread state, use the \ref cy_rtos_thread_get_state() function.
 *
 * @param[in] thread     Handle of the terminated thread to delete
 * @param[out] running   Returns true if the thread is running, otherwise false
 *
 * @returns The status of the thread running check. Same across all RTOS kernels
 *          [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 */
cy_rslt_t cy_rtos_thread_is_running(const cy_thread_t* thread, bool* running);

/** Gets the state the thread is currently in
 *
 * This function is called to determine if a thread is running/blocked/inactive/ready etc.
 *
 * @param[in] thread     Handle of the terminated thread to delete
 * @param[out] state     Returns the state the thread is currently in
 *
 * @returns The status of the thread state check. Same across all RTOS kernels
 *          [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
cy_rslt_t cy_rtos_thread_get_state(const cy_thread_t* thread, cy_thread_state_t* state);

/** Get current thread handle
 *
 * Returns the unique thread handle of the current running thread.
 *
 * @param[out] thread Handle of the current running thread
 *
 * @returns The status of thread join request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_BAD_PARAM].
 */
cy_rslt_t cy_rtos_thread_get_handle(cy_thread_t* thread);


/** Suspend current thread until notification is received
 *
 * This function suspends the execution of current thread until it is notified
 * by \ref cy_rtos_thread_set_notification from another thread or ISR, or timed out with
 * specify timeout value
 *
 * @param[in] timeout_ms  Maximum number of milliseconds to wait
 *                        Use the \ref CY_RTOS_NEVER_TIMEOUT constant to wait forever.
 *
 * @returns The status of thread wait. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_TIMEOUT].
 *          \n Specific for kernel:
 *          \li RTX and THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
cy_rslt_t cy_rtos_thread_wait_notification(cy_time_t timeout_ms);


/** Set the thread notification for a thread
 *
 * This function sets the thread notification for the target thread.
 * The target thread waiting for the notification to be set will resume from suspended state.
 *
 * @param[in] thread     Handle of the target thread
 *
 * @returns The status of thread wait. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li RTX and THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
cy_rslt_t cy_rtos_thread_set_notification(const cy_thread_t* thread);


/** Get the name of a thread
 *
 * This function returns the name of the target thread
 *
 * @param[in] thread        Handle of the target thread
 *
 * @param[out] thread_name   Will be updated to point to the thread name. Can return
 * NULL in the case of no thread name.
 *
 * @returns The status of getting the thread name. Same across all RTOS
 *          kernels [\ref CY_RSLT_SUCCESS].
 *          \n Specific for kernel:
 *          \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 *
 */
cy_rslt_t cy_rtos_thread_get_name(const cy_thread_t* thread, const char** thread_name);


/** \} group_abstraction_rtos_threads */


/*********************************************
 * Scheduler
 ********************************************/

/**
 * \ingroup group_abstraction_rtos_scheduler
 * \{
 */

/** Suspend the scheduler
 *
 * \ingroup group_abstraction_rtos_scheduler
 *
 * This function suspends the scheduler and makes sure that the code executed after the call does
 * not get interrupted by a task switch.
 * Multiple suspend calls can be done making nesting possible granted
 * that the same number of resume calls are made.
 *
 * @note API functions that have the potential to cause a context switch
 *  must not be called while the scheduler is suspended.
 *
 * @return The status of scheduler suspend request. Same across all RTOS
 *         kernels [\ref CY_RSLT_SUCCESS].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_BAD_PARAM].
 */
cy_rslt_t cy_rtos_scheduler_suspend(void);

/** Resume the scheduler
 *
 * \ingroup group_abstraction_rtos_scheduler
 *
 * This function resumes the scheduler after it was suspended.
 * If incorrectly called (called more times than \c cy_rtos_scheduler_suspend) it fails returning
 * \ref CY_RTOS_BAD_PARAM
 *
 * @return The status of scheduler resume request. Same across all RTOS kernels
 *         [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 */
cy_rslt_t cy_rtos_scheduler_resume(void);

/** Gets the state the scheduler is currently in
 *
 * \ingroup group_abstraction_rtos_scheduler
 *
 * This function is called to determine if the scheduler is running/suspend/not started.
 *
 * @param[out] state     Returns the state the scheduler is currently in
 *
 * @returns The status of the scheduler state check. Same across all RTOS kernels
 *          [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 */
cy_rslt_t cy_rtos_scheduler_get_state(cy_scheduler_state_t* state);

/** \} group_abstraction_rtos_scheduler */



/********************************************* Mutexes ********************************************/

/**
 * \ingroup group_abstraction_rtos_mutex
 * \{
 */

/** Create a mutex which can support recursion or not.
 *
 * Creates a binary mutex which can be used for mutual exclusion to prevent simultaneous
 * access of shared resources. Created mutexes can support priority inheritance if recursive.
 *
 * \note Not all RTOS implementations support non-recursive mutexes. In this case a recursive
 * mutex will be created.
 *
 * @param[out] mutex     Pointer to the mutex handle to be initialized
 * @param[in]  recursive Should the created mutex support recursion or not
 *
 * @return The status of mutex creation request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
cy_rslt_t cy_rtos_mutex_init(cy_mutex_t* mutex, bool recursive);

/** Get a mutex.
 *
 * If the mutex is available, it is acquired and this function returned.
 * If the mutex is not available, the thread waits until the mutex is available
 * or until the timeout occurs.
 *
 * @note This function must not be called from an interrupt context as it may block.
 *
 * @param[in] mutex       Pointer to the mutex handle
 * @param[in] timeout_ms  Maximum number of milliseconds to wait while attempting to get
 *                        the mutex. Use the \ref CY_RTOS_NEVER_TIMEOUT constant to wait forever.
 *
 * @return The status of the get mutex. Returns timeout if mutex was not acquired
 *         before timeout_ms period. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_TIMEOUT].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
cy_rslt_t cy_rtos_mutex_get(const cy_mutex_t* mutex, cy_time_t timeout_ms);

