zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/include/cyabs_rtos.h
/** Checks if the thread is running
 *
 * This function is called to determine if a thread is actively running or not. For information on
 * the thread state, use the \ref cy_rtos_get_thread_state() function.
 *
 * @param[in] thread     Handle of the terminated thread to delete
 * @param[out] running   Returns true if the thread is running, otherwise false
 *
 * @returns The status of the thread running check. Same across all RTOS
 *          kernels [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 */
#define cy_rtos_is_thread_running(thread, running) \
    cy_rtos_thread_is_running(thread, running)

/** Set the thread notification for a thread
 *
 * This function sets the thread notification for the target thread.
 * The target thread waiting for the notification to be set will resume from suspended state.
 *
 * @param[in] thread     Handle of the target thread
 * @param[in] in_isr     If true this is being called from within an ISR
 *
 * @returns The status of thread wait. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li RTX and THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_set_thread_notification(thread, in_isr) \
    cy_rtos_thread_set_notification(thread)

/** Suspend current thread until notification is received
 *
 * This function suspends the execution of current thread until it is notified
 * by \ref cy_rtos_set_thread_notification from another thread or ISR, or timed out with
 * specify timeout value
 *
 * @param[in] timeout_ms  Maximum number of milliseconds to wait
 *                        Use the \ref CY_RTOS_NEVER_TIMEOUT constant to wait forever.
 *
 * @returns The status of thread wait. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_TIMEOUT].
 *          \n Specific for kernel:
 *          \li RTX and THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_wait_thread_notification(timeout_ms)   cy_rtos_thread_wait_notification(timeout_ms)

/** Gets the state the thread is currently in
 *
 * This function is called to determine if a thread is running/blocked/inactive/ready etc.
 *
 * @param[in] thread     Handle of the terminated thread to delete
 * @param[out] state     Returns the state the thread is currently in
 *
 * @returns The status of the thread state check. Same across all RTOS kernels
 *          [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_get_thread_state(thread, state)   cy_rtos_thread_get_state(thread, state)

/** Waits for a thread to complete.
 *
 * This must be called on any thread that can complete to ensure that any resources that
 * were allocated for it are cleaned up.
 *
 * @param[in] thread Handle of the thread to wait for
 *
 * @returns The status of thread join request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 * \ref
 * CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li RTX: [\ref CY_RTOS_TIMEOUT, \ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *          \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_join_thread(thread)               cy_rtos_thread_join(thread)

/** Get current thread handle
 *
 * Returns the unique thread handle of the current running thread.
 *
 * @param[out] thread Handle of the current running thread
 *
 * @returns The status of thread join request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_BAD_PARAM].
 */
#define cy_rtos_get_thread_handle(thread)         cy_rtos_thread_get_handle(thread)

/** Terminates another thread.
 *
 * This function is called to terminate another thread and reap the resources claimed
 * by the thread. This should be called both when forcibly terminating another thread
 * as well as any time a thread can exit on its own. For some RTOS implementations
 * this is not required as the thread resources are claimed as soon as it exits. In
 * other cases, this must be called to reclaim resources. Threads that are terminated
 * must still be joined (\ref cy_rtos_join_thread) to ensure their resources are fully
 * cleaned up.
 *
 * @param[in] thread Handle of the thread to terminate
 *
 * @returns The status of the thread terminate. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *          \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li RTX: [\ref CY_RTOS_TIMEOUT, \ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *          \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_terminate_thread(thread)          cy_rtos_thread_terminate(thread)

/** Exit the current thread.
 *
 * This function is called just before a thread exits.  In some cases it is sufficient
 * for a thread to just return to exit, but in other cases, the RTOS must be explicitly
 * signaled. In cases where a return is sufficient, this should be a null function.
 * In cases where the RTOS must be signaled, this function should perform that operation.
 * In code using RTOS services, this function should be placed at any location
 * where the main thread function will return, exiting the thread. Threads that can
 * exit must still be joined (\ref cy_rtos_join_thread) to ensure their resources are
 * fully cleaned up.
 *
 * @return The status of thread exit request only for FreeRTOS. [\ref CY_RSLT_SUCCESS].
 */
#define cy_rtos_exit_thread                       cy_rtos_thread_exit
/** \} group_abstraction_rtos_threads */

//==================================================================================================
// Mutexes
//==================================================================================================
/**
 * \ingroup group_abstraction_rtos_mutex
 * \{
 */

/** Create a mutex which can support recursion or not.
 *
 * Creates a binary mutex which can be used for mutual exclusion to prevent simultaneous
 * access of shared resources. Created mutexes can support priority inheritance if recursive.
 *
 * \note Not all RTOS implementations support non-recursive mutexes. In this case a recursive
 * mutex will be created.
 *
 * @param[out] mutex     Pointer to the mutex handle to be initialized
 * @param[in]  recursive Should the created mutex support recursion or not
 *
 * @return The status of mutex creation request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_mutex2(mutex, recursive) \
    cy_rtos_mutex_init(mutex, recursive)

/** Create a mutex which can support recursion.
 *
 * Creates a binary mutex which can be used for mutual exclusion to prevent simultaneous
 * access of shared resources. Created mutexes can support priority inheritance if recursive.
 *
 * \note Not all RTOS implementations support non-recursive mutexes. In this case a recursive
 * mutex will be created.
 *
 * @param[out] mutex     Pointer to the mutex handle to be initialized
 *
 * @return The status of mutex creation request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_mutex(mutex) \
    cy_rtos_mutex_init(mutex, true)

/** Get a mutex.
 *
 * If the mutex is available, it is acquired and this function returned.
 * If the mutex is not available, the thread waits until the mutex is available
 * or until the timeout occurs.
 *
 * @note This function must not be called from an interrupt context as it may block.
 *
 * @param[in] mutex       Pointer to the mutex handle
 * @param[in] timeout_ms  Maximum number of milliseconds to wait while attempting to get
 *                        the mutex. Use the \ref CY_RTOS_NEVER_TIMEOUT constant to wait forever.
 *
 * @return The status of the get mutex. Returns timeout if mutex was not acquired
 *         before timeout_ms period. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_TIMEOUT].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_get_mutex(mutex, timeout_ms) \
    cy_rtos_mutex_get(mutex, timeout_ms)

