zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/include/cyabs_rtos.h
/** Set a mutex.
 *
 * The mutex is released allowing any other threads waiting on the mutex to
 * obtain the semaphore.
 *
 * @param[in] mutex   Pointer to the mutex handle
 *
 * @return The status of the set mutex request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_set_mutex(mutex)       cy_rtos_mutex_set(mutex)

/** Deletes a mutex.
 *
 * This function frees the resources associated with a semaphore.
 *
 * @param[in] mutex Pointer to the mutex handle
 *
 * @return The status to the delete request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_deinit_mutex(mutex)    cy_rtos_mutex_deinit(mutex)

/** \} group_abstraction_rtos_mutex */

//==================================================================================================
// Semaphores
//==================================================================================================
/**
 * \ingroup group_abstraction_rtos_semaphore
 * \{
 */

/**
 * Create a semaphore
 *
 * This is basically a counting semaphore. It can be used for synchronization between tasks and
 * tasks and interrupts.
 *
 * @param[in,out] semaphore  Pointer to the semaphore handle to be initialized
 * @param[in] maxcount       The maximum count for this semaphore
 * @param[in] initcount      The initial count for this semaphore
 *
 * @return The status of the semaphore creation. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_semaphore(semaphore, maxcount, initcount) \
    cy_rtos_semaphore_init(semaphore, maxcount, initcount)

/**
 * Get/Acquire a semaphore
 *
 * If the semaphore count is zero, waits until the semaphore count is greater than zero.
 * Once the semaphore count is greater than zero, this function decrements
 * the count and return.  It may also return if the timeout is exceeded.
 *
 * @param[in] semaphore   Pointer to the semaphore handle
 * @param[in] timeout_ms  Maximum number of milliseconds to wait while attempting to get
 *                        the semaphore. Use the \ref CY_RTOS_NEVER_TIMEOUT constant to wait
 *                        forever. Must be zero if in_isr is true.
 * @param[in] in_isr      true if we are trying to get the semaphore from with an ISR
 * @return The status of get semaphore operation. Same across all RTOS kernels [\ref
 * CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_TIMEOUT].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_get_semaphore(semaphore, timeout_ms, \
                              in_isr) cy_rtos_semaphore_get(semaphore, timeout_ms)

/**
 * Set/Release a semaphore
 *
 * Increments the semaphore count, up to the maximum count for this semaphore.
 *
 * @param[in] semaphore   Pointer to the semaphore handle
 * @param[in] in_isr      Value of true indicates calling from interrupt context
 *                        Value of false indicates calling from normal thread context
 * @return The status of set semaphore operation Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_set_semaphore(semaphore, in_isr) cy_rtos_semaphore_set(semaphore)

/**
 * Get the count of a semaphore.
 *
 * Gets the number of available tokens on the semaphore.
 *
 * @param[in]  semaphore   Pointer to the semaphore handle
 * @param[out] count       Pointer to the return count
 * @return The status of get semaphore count operation Same across all RTOS kernels [\ref
 * CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_get_count_semaphore(semaphore, count) cy_rtos_semaphore_get_count(semaphore, count)

/**
 * Deletes a semaphore
 *
 * This function frees the resources associated with a semaphore.
 *
 * @param[in] semaphore   Pointer to the semaphore handle
 *
 * @return The status of semaphore deletion. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_TIMEOUT, \ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_deinit_semaphore(semaphore) cy_rtos_semaphore_deinit(semaphore)

/** \} group_abstraction_rtos_semaphore */

//==================================================================================================
// Events
//==================================================================================================

/**
 * \ingroup group_abstraction_rtos_event
 * \{
 */

/** Create an event.
 *
 * This is an event which can be used to signal a set of threads
 * with a 32 bit data element.
 *
 * @param[in,out] event Pointer to the event handle to be initialized
 *
 * @return The status of the event initialization request. Same across all RTOS
 *         kernels [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_event(event)    cy_rtos_event_init(event)

/** Set the event flag bits.
 *
 * This is an event which can be used to signal a set of threads
 * with a 32 bit data element. Any threads waiting on this event are released
 *
 * @param[in] event  Pointer to the event handle
 * @param[in] bits   The value of the 32 bit flags
 * @param[in] in_isr If true, this is called from an ISR, otherwise from a thread
 *
 * @return The status of the set request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_setbits_event(event, bits, in_isr) cy_rtos_event_setbits(event, bits)

/**
 * Clear the event flag bits
 *
 * This function clears bits in the event.
 *
 * @param[in] event   Pointer to the event handle
 * @param[in] bits    Any bits set in this value, will be cleared in the event.
 * @param[in] in_isr  if true, this is called from an ISR, otherwise from a thread
 *
 * @return The status of the clear flags request. Same across all RTOS kernels [\ref
 * CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_clearbits_event(event, bits, in_isr) cy_rtos_event_clearbits(event, bits)

