zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/include/cyabs_rtos.h
/** Get the event bits.
 *
 * Returns the current bits for the event.
 *
 * @param[in]  event Pointer to the event handle
 * @param[out] bits  pointer to receive the value of the event flags
 *
 * @return The status of the get request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_getbits_event(event, bits) cy_rtos_event_getbits(event, bits)

/** Wait for the event and return bits.
 *
 * Waits for the event to be set and then returns the bits associated
 * with the event, or waits for the given timeout period.
 * @note This function returns if any bit in the set is set.
 *
 * @param[in] event        Pointer to the event handle
 * @param[in,out] bits     pointer to receive the value of the event flags
 * @param[in] clear        if true, clear any bits set that cause the wait to return
 *                         if false, do not clear bits
 * @param[in] all          if true, all bits in the initial bits value must be set to return
 *                         if false, any one bit in the initial bits value must be set to return
 * @param[in] timeout_ms   The amount of time to wait in milliseconds
 *
 * @return The status of the wait for event request. Same across all RTOS
 *         kernels [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_TIMEOUT].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_waitbits_event(event, bits, clear, all, \
                               timeout_ms) \
    cy_rtos_event_waitbits(event, bits, clear, all, timeout_ms)

/** Deinitialize a event.
 *
 * This function frees the resources associated with an event.
 *
 * @param[in] event Pointer to the event handle
 *
 * @return The status of the deletion request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_deinit_event(event)    cy_rtos_event_deinit(event)

/** \} group_abstraction_rtos_event */

//==================================================================================================
// Queues
//==================================================================================================

/**
 * \ingroup group_abstraction_rtos_queue
 * \{
 */

/** Create a queue.
 *
 * This is a queue of data where entries are placed on the back of the queue
 * and removed from the front of the queue.
 *
 * @param[out] queue    Pointer to the queue handle
 * @param[in]  length   The maximum length of the queue in items
 * @param[in]  itemsize The size of each item in the queue.
 *
 * @return The status of the init request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_NO_MEMORY].
 *         \n Specific for kernel:
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_queue(queue, length, itemsize) \
    cy_rtos_queue_init(queue, length, itemsize)

/** Put an item in a queue.
 *
 * This function puts an item in the queue. The item is copied
 * into the queue using a memory copy and the data pointed to by item_ptr
 * is no longer referenced once the call returns.
 *
 * @note If in_isr is true, timeout_ms must be zero.
 *
 * @param[in] queue      Pointer to the queue handle
 * @param[in] item_ptr   Pointer to the item to place in the queue
 * @param[in] timeout_ms The time to wait to place the item in the queue
 * @param[in] in_isr     If true this is being called from within and ISR
 *
 * @return The status of the put request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 *         \li THREADX: [\ref CY_RTOS_NO_MEMORY].
 */
#define cy_rtos_put_queue(queue, item_ptr, timeout_ms, in_isr) \
    cy_rtos_queue_put(queue, item_ptr, timeout_ms)

/** Gets an item in a queue.
 *
 * This function gets an item from the queue. The item is copied
 * out of the queue into the memory provide by item_ptr. This space must be
 * large enough to hold a queue entry as defined when the queue was initialized.
 *
 * @note If in_isr is true, timeout_ms must be zero.
 * @note A value of CY_RTOS_NEVER_TIMEOUT assigned to timeout_ms will cause the task to block
 * indefinitely (without a timeout).
 *
 * @param[in] queue      Pointer to the queue handle
 * @param[in] item_ptr   Pointer to the memory for the item from the queue
 * @param[in] timeout_ms The time to wait to get an item from the queue
 * @param[in] in_isr     If true this is being called from within an ISR
 *
 * @return The status of the get request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 *         \li THREADX: [\ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_get_queue(queue, item_ptr, timeout_ms, in_isr) \
    cy_rtos_queue_get(queue, item_ptr, timeout_ms)

/** Return the number of items in the queue.
 *
 * This function returns the number of items currently in the queue.
 *
 * @param[in]  queue       Pointer to the queue handle
 * @param[out] num_waiting Pointer to the return count
 *
 * @return The status of the count request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li THREADX: [CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_count_queue(queue, num_waiting) \
    cy_rtos_queue_count(queue, num_waiting)

/** Return the amount of empty space in the queue.
 *
 * This function returns the amount of empty space in the
 * queue. For instance, if the queue was created with 10 entries max and there
 * are currently 2 entries in the queue, this will return 8.
 *
 * @param[in]  queue      Pointer to the queue handle
 * @param[out] num_spaces Pointer to the return count.
 *
 * @return The status of the space request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li THREADX: [CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_space_queue(queue, num_spaces) \
    cy_rtos_queue_space(queue, num_spaces)

/** Reset the queue.
 *
 * This function sets the queue to empty.
 *
 * @param[in] queue pointer to the queue handle
 *
 * @return The status of the reset request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_reset_queue(queue) \
    cy_rtos_queue_reset(queue)

