zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/include/cyabs_rtos.h
/** Deinitialize the queue handle.
 *
 * This function de-initializes the queue and returns all
 * resources used by the queue.
 *
 * @param[in] queue Pointer to the queue handle
 *
 * @return The status of the deinit request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_deinit_queue(queue) \
    cy_rtos_queue_deinit(queue)

/** \} group_abstraction_rtos_queue */

//==================================================================================================
// Timers
//==================================================================================================

/**
 * \ingroup group_abstraction_rtos_timer
 * \{
 */

/** Create a new timer.
 *
 * This function initializes a timer object.
 * @note The timer is not active until start is called.
 * @note The callback may be (likely will be) called from a different thread.
 *
 * @param[out] timer Pointer to the timer handle to initialize
 * @param[in]  type  Type of timer (periodic or once)
 * @param[in]  fun   The function
 * @param[in]  arg   Argument to pass along to the callback function
 *
 * @return The status of the init request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li FreeRTOS: [\ref CY_RTOS_NO_MEMORY].
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_GENERAL_ERROR].
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_init_timer(timer, type, fun, arg) \
    cy_rtos_timer_init(timer, type, fun, arg)

/** Sends a request to start the timer. Depending on the priorities of threads in the system,
 * it may be necessary for high priority items to wait before the timer actually starts running.
 *
 * @param[in] timer  Pointer to the timer handle
 * @param[in] num_ms The number of milliseconds to wait before the timer fires
 *
 * @return The status of the start request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_start_timer(timer, num_ms) \
    cy_rtos_timer_start(timer, num_ms)

/** Sends a request to stop the timer. Depending on the priorities of threads in the system,
 * it may be necessary for high priority items to wait before the timer is actually stopped.
 *
 * @param[in] timer Pointer to the timer handle
 *
 * @return The status of the stop request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_stop_timer(timer)    cy_rtos_timer_stop(timer)

/** Returns state of a timer.
 *
 * @param[in]  timer Pointer to the timer handle
 * @param[out] state Return value for state, true if running, false otherwise
 *
 * @return The status of the is_running request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM].
 *         \n Specific for kernel:
 *         \li THREADX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_is_running_timer(timer, state) \
    cy_rtos_timer_is_running(timer, state)

/** Deinit the timer.
 *
 * This function deinitializes the timer and frees all consumed resources.
 *
 * @param[in] timer Pointer to the timer handle
 *
 * @return The status of the deinit request. Same across all RTOS kernels [\ref CY_RSLT_SUCCESS,
 *         \ref CY_RTOS_BAD_PARAM, \ref CY_RTOS_GENERAL_ERROR].
 *         \n Specific for kernel:
 *         \li RTX: [\ref CY_RTOS_NO_MEMORY, \ref CY_RTOS_TIMEOUT].
 */
#define cy_rtos_deinit_timer(timer)    cy_rtos_timer_deinit(timer)

/** \} group_abstraction_rtos_timer */

//==================================================================================================
// Time
//==================================================================================================

/**
 * \ingroup group_abstraction_rtos_time
 * \{
 */

/** Gets time in milliseconds since RTOS start.
 *
 * @note Since this is only 32 bits, it will roll over every 49 days, 17 hours, 2 mins, 47.296
 * seconds
 *
 * @param[out] tval Pointer to the struct to populate with the RTOS time
 *
 * @returns Time in milliseconds since the RTOS started. Same across all RTOS
 *          kernels [\ref CY_RSLT_SUCCESS, \ref CY_RTOS_BAD_PARAM].
 *          \n Specific for kernel:
 *          \li RTX: [\ref CY_RTOS_GENERAL_ERROR].
 */
#define cy_rtos_get_time(tval)                cy_rtos_time_get(tval)

/** \} group_abstraction_rtos_time */

#ifdef __cplusplus
} // extern "C"
#endif

#endif /* CYABS_RTOS_H */
